[{
    "id": 2,
    "blurbs": [{
      "text": "Alaska ranks #2 in business tax climate per the @taxfoundation, and maintaining a taxpayer-friendly environment is on the minds of many legislators as they grapple with revenue volatility issues",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 5,
    "blurbs": [{
      "text": "Arkansas taxpayers have reason to be optimistic about the prospects for tax reform, but for now, the state's business tax climate ranks a disappointing 45th on the @taxfoundation Index",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 6,
    "blurbs": [{
      "text": "California ranks #49 in business tax climate, and increasingly, businesses are taking notice despite everything else the state offers. More from the @taxfoundation",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 9,
    "blurbs": [{
      "text": "Connecticut's business tax climate improved slightly as a corporate surcharge phased down, but the Nutmeg State still has the nation's 3rd worst rank on the @taxfoundation State Business Tax Climate Index.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 10,
    "blurbs": [{
      "text": "Delaware improved to 11th in @taxfoundation business tax climate rankings as lawmakers scrapped an estate tax that raised little revenue and drove high earners out of state.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 11,
    "blurbs": [{
      "text": "The District of Columbia completed the final stage of its multi-year tax reform, though if it were a state, it would still rank 46th on business tax climate. More from @taxfoundation",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 12,
    "blurbs": [{
      "text": "Florida has the 4th best business tax climate in the country according to a new @taxfoundation report. It doesn't hurt that the state forgoes an income tax.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 13,
    "blurbs": [{
      "text": "Georgia taxpayers will see lower tax rates next year. The state's business tax climate currently ranks 33rd, and can be expected to improve on @taxfoundation rankings once reform kicks in",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 15,
    "blurbs": [{
      "text": "Hawaii dropped to 38th on business tax climate after legislators reimposed three \"temporary\" income tax brackets—with a top rate of 11%! More from the @taxfoundation",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 16,
    "blurbs": [{
      "text": "Idaho policymakers responded to new revenue from federal tax reform by giving it back to taxpayers, cutting PIT and CIT rates and improving to 21st on the @taxfoundation business tax climate index",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 17,
    "blurbs": [{
      "text": "Illinois lawmakers have doubled down on high business tax rates in recent years, and it shows, with the state ranking 36th on the @taxfoundation State Business Tax Climate Index",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 18,
    "blurbs": [{
      "text": "Indiana continues to reform its tax code and cut tax rates, most recently with a CIT cut from 6 to 5.75%. No wonder the state ranks #10 on the @taxfoundation State Business Tax Climate Index",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 19,
    "blurbs": [{
      "text": "Iowa ranks an unenviable 45th in business tax climate, but with tax reforms set to phase in starting next year, things can only improve. More from @taxfoundation",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 20,
    "blurbs": [{
      "text": "Kansas slipped to 21st in business tax climate per @taxfoundation as recurring revenue shortfalls forced another round of rate increases.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 21,
    "blurbs": [{
      "text": "Kentucky improved 16 spots, from #39 to #23, on the @taxfoundation State Business Tax Climate Index after adopting comprehensive tax reform this year",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 22,
    "blurbs": [{
      "text": "Louisiana's sales tax rate nudged down, but a convoluted tax code with high rates still has the state at #44 on the @taxfoundation State Business Tax Climate Index",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 25,
    "blurbs": [{
      "text": "Massachusetts: it's not your father's \"Taxachusetts\" anymore, ranking 29th on business tax climate according to the @taxfoundation",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 29,
    "blurbs": [{
      "text": "Missouri legislators approved PIT and CIT rate cuts in the waning days of session, but they don't go into effect until next year. For now, the Show-Me State ranks 14th in business tax climate on @taxfoundation Index",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 31,
    "blurbs": [{
      "text": "Nebraska is middle of the pack (#24) on its business tax climate according to a new @taxfoundation report",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 33,
    "blurbs": [{
      "text": "New Hampshire is the Live Free or Die State, and that ethos shows up in its tax code, with the @taxfoundation ranking NH #6 on business tax climate",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 34,
    "blurbs": [{
      "text": "New Jersey now has double-digit top rates for both its individual (10.75%) and corporate (11.5%) income taxes, more bad news for the state that continues to rank worst on the @taxfoundation State Business Tax Climate Index",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 35,
    "blurbs": [{
      "text": "New Mexico is #25 in business tax climate after completing a phase-down of its corporate income tax rate to 5.9%. More from the @taxfoundation",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 36,
    "blurbs": [{
      "text": "New York is #48 on business tax climate, but it does surprisingly well on the corporate tax itself (7th best on the corporate tax component of the @taxfoundation Index) following several years of reforms",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 37,
    "blurbs": [{
      "text": "North Carolina ranks #12 on business tax climate, vying with UT and IN for the best rank among states levying all the major tax types, according to new @taxfoundation rankings",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 39,
    "blurbs": [{
      "text": "Ohio's gross receipts tax (the CAT) drags it down on @taxfoundation business tax climate rankings, where the state ranks an unenviable 42nd",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 42,
    "blurbs": [{
      "text": "Pennsylvania has one of the highest-rate and least competitive corporate income taxes in the country, contrasted with a highly competitive individual income tax. The state ranks 34th on overall business tax climate per the @taxfoundation",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 44,
    "blurbs": [{
      "text": "Rhode Island ranks 37th on business tax climate, with policymakers working to make the state's UI taxes more competitive. More from @taxfoundation",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 46,
    "blurbs": [{
      "text": "South Dakota boasts the nation's third best business tax climate according to the latest research from the @taxfoundation",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 48,
    "blurbs": [{
      "text": "Texas ranks #15 in business tax climate, with an anachronistic gross receipts tax interfering with an otherwise enviable tax code. More from the @taxfoundation",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 49,
    "blurbs": [{
      "text": "Utah has the 8th best business tax climate in the country, and the best of any state which levies all the major taxes, per new @taxfoundation report",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 50,
    "blurbs": [{
      "text": "Vermont trimmed its top marginal income tax rate and eliminated a bracket in response to anticipated revenue increases from federal tax reform. The result? An improvement to #41 on business tax climate per @taxfoundation",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 53,
    "blurbs": [{
      "text": "Washington ranks #20 on business tax climate per the @taxfoundation, but that rank could be in jeopardy as state policymakers contemplate a bevy of new and higher taxes",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 56,
    "blurbs": [{
      "text": "Wyoming once again boasts the best business tax climate in the nation according to the @taxfoundation State Business Tax Climate Index",
      "hashtags": "stateTaxReform"
    }]
  }
]