[{
    "id": 2,
    "blurbs": [{
      "text": "Alaska ranks #3 in business tax climate per the @taxfoundation, and maintaining a taxpayer-friendly environment is on the minds of many legislators as they grapple with revenue volatility issues.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 5,
    "blurbs": [{
      "text": "Arkansas recently adoped tax reform legislation, but until those reforms start phasing in, its current uncompetitive tax code yields a ranking of 46th on the @taxfoundation Index.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 6,
    "blurbs": [{
      "text": "California ranks 48th in business tax climate, and increasingly, businesses are taking notice despite everything else the state offers. More from the @taxfoundation.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 9,
    "blurbs": [{
      "text": "Connecticut lawmakers have been exploring structural improvements to the tax code, and with good reason; the Nutmeg State currently ranks 47th on the @taxfoundation State Business Tax Climate Index.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 12,
    "blurbs": [{
      "text": "Florida has the 4th best business tax climate in the country according to a new @taxfoundation report. It doesn't hurt that the state forgoes an income tax.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 13,
    "blurbs": [{
      "text": "Georgia's tax climate is improving as the state lowered rates and implemented modest reforms in response to base-broadening under the new federal tax law. The state now ranks 32nd on the @taxfoundation Index.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 15,
    "blurbs": [{
      "text": "Hawaii ranks 37th on business tax climate, down 11 places since it reimposed 3 'temporary' income tax brackets—with a top rate of 11%—and rolled back estate tax reforms. The @taxfoundation has more.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 18,
    "blurbs": [{
      "text": "Indiana continues to cut its corporate income tax rate, the culmination of years of reforms to the state tax code. No wonder the state ranks 10th on the @taxfoundation State Business Tax Climate Index.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 19,
    "blurbs": [{
      "text": "Iowa ranks an unenviable 43rd in business tax climate, but with tax reforms beginning to phase in, things can only improve. More from the @taxfoundation.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 20,
    "blurbs": [{
      "text": "Kansas' response to federal tax law and online sales tax have been unusually bad, taxing intl. income and denying safe harbor for small remote sellers. The state dropped to 34th on the @taxfoundation Index.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 21,
    "blurbs": [{
      "text": "Kentucky ranks 24th on the @taxfoundation State Business Tax Climate Index, a 13-place improvement from two years ago, following the adoption of a comprehensive tax reform package last year.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 22,
    "blurbs": [{
      "text": "Louisiana's combined sales tax rate is no longer the nation's highest, but a convoluted tax code with high rates still has the state at #41 on the @taxfoundation State Business Tax Climate Index.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 25,
    "blurbs": [{
      "text": "Massachusetts isn't \"Taxachusetts\" anymore, but the adoption of a new payoll tax dropped the state to 36th on business tax climate, according to the @taxfoundation.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 29,
    "blurbs": [{
      "text": "With individual income tax cuts going into effect this year and corporate tax reform slated for next year, Missouri ranks 14th in business tax climate on the @taxfoundation Index, and will continue to improve.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 33,
    "blurbs": [{
      "text": "New Hampshire is the Live Free or Die State, and that ethos shows up in its tax code, with the @taxfoundation ranking the state #6 on business tax climate after legislators trimmed two business tax rates.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 34,
    "blurbs": [{
      "text": "Last year, New Jersey implemented double-digit rates for both its individual and corporate income taxes, more bad news for the state that continues to rank worst on the @taxfoundation State Business Tax Climate Index.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 37,
    "blurbs": [{
      "text": "North Carolina ranks 15th on business tax climate, vying with Indiana and Utah for the best rank among states levying all the major tax types, according to new @taxfoundation rankings.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 39,
    "blurbs": [{
      "text": "Ohio's gross receipts tax (the CAT) drags it down on @taxfoundation business tax climate rankings, where the state ranks an unenviable 38th.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 41,
    "blurbs": [{
      "text": "Oregon ranks 8th on business tax climate according to the @taxfoundation, but that will change when its uncompetitive new gross receipts tax goes into effect next year.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 42,
    "blurbs": [{
      "text": "Pennsylvania has one of the highest-rate and least competitive corporate income taxes in the country, contrasted with a highly competitive individual income tax. The state ranks 29th on overall business tax climate per the @taxfoundation.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 46,
    "blurbs": [{
      "text": "South Dakota boasts the nation's second-best business tax climate according to the latest rankings from the @taxfoundation.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 48,
    "blurbs": [{
      "text": "Texas ranks 13th in business tax climate, with an anachronistic gross receipts tax interfering with an otherwise enviable tax code.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 49,
    "blurbs": [{
      "text": "Utah slid one place after raising its sales tax, but still has the 9th best business tax climate in the country, and the best of any state that levies all the major taxes, per a new @taxfoundation report.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 53,
    "blurbs": [{
      "text": "Washington ranks #19 on business tax climate per the @taxfoundation, but that rank could be in jeopardy as state policymakers contemplate a bevy of new and higher taxes.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 55,
    "blurbs": [{
      "text": "Wisconsin ranks 26th in business climate per the @taxfoundation, improving with the repeal of the alternative minimum tax for individual filers.",
      "hashtags": "stateTaxReform"
    }]
  },
  {
    "id": 56,
    "blurbs": [{
      "text": "Wyoming once again boasts the best business tax climate in the nation according to the @taxfoundation State Business Tax Climate Index, though lawmakers are currently considering an unusually-designed corporate income tax.",
      "hashtags": "stateTaxReform"
    }]
  }
]