[
    {
      "id": 4,
      "text": "Arizona transitioned from a four-bracket individual income tax with a top rate of 4.5 percent to a two-bracket system with a top rate of 2.98 percent, a waypoint on the state’s transition to a 2.5 percent single-rate tax. Initially scheduled for 2024, robust revenue growth has led to the certification of the 2.5 percent rate for January 1, 2023, a significant development that will further improve Arizona’s ranking in next year’s Index. This year’s changes, however, were sufficient for Arizona to improve five places overall, from 24th to 19th."
    },
    {
      "id": 5,
      "text": "Like many states, Arkansas adopted both corporate and individual income tax rate reductions. In Arkansas’s case, these rate reductions—to a top individual income tax rate of 4.9 percent, down from 5.9 percent, and a corporate rate reduced from 6.2 to 5.9 percent—went into effect for the 2022 tax year. The corporate income tax rate reduction also resulted in the consolidation of an existing bracket. These changes were the primary driver of the state’s improvement from 43rd to 40th overall."
    },
    {
      "id": 13,
      "text": "Under legislation adopted in 2022, Georgia will adopt a 5.49 percent flat-rate income tax in 2024 and ultimately phase that rate down to 4.99 percent. These changes, however, lie in the future, and for now, improvements in the tax policies of three other states—Mississippi, Nebraska, and South Carolina—saw Georgia slide three places by standing still."
    },
    {
      "id": 16,
      "text": "Idaho improved two places overall, from 17th to 15th, due to the implementation of individual and corporate income tax rate reductions which took the individual income tax’s top rate, and the corporate income tax’s flat rate, from 6.5 to 6.0 percent. A ballot measure that would have created a new top rate of 10.925 percent to raise additional revenue for public education was taken off the ballot, and a deal was struck instead to provide additional education funding while implanting a 5.8 percent flat individual income tax rate in 2023. This change, which will be reflected in next year’s Index, will result in a further improvement in Idaho’s ranking."
    },
    {
      "id": 22,
      "text": "The Bayou state implemented a package of tax reforms resulting in an improvement of three places on the Index, from 42nd to 39th, while improving the state’s individual income tax component by nine places and the corporate and property tax components by two places each. Reforms approved by voters in November 2021 yielded the repeal of the deduction for federal taxes paid, replaced by lower statutory tax rates. The top rate of the individual income tax was cut from 6.0 to 4.25 percent, while the state’s five corporate income tax brackets were consolidated into three, with a reduction in the top rate from 8 to 7.5 percent. Additionally, the capital stock tax rate was reduced from 0.3 percent to 0.275 percent, with the goal of eventual repeal through tax triggers."
    },
    {
      "id": 31,
      "text": "Legislative Bill 432, signed into law in 2021, reduced Nebraska’s top marginal corporate income tax rate from 7.81 percent to 7.5 percent on January 1, 2022, and will further reduce the rate to 7.25 percent in January 2023. Additional legislation (LB 873) enacted in 2022 will reduce the state’s top marginal individual income tax rate from 6.84 to 5.84 percent over five years, beginning in 2023. This year’s corporate tax reduction contributed to Nebraska improving one place overall, from 30th to 29th."
    },
    {
      "id": 35,
      "text": "Alone among states, New Mexico used recent revenue growth to facilitate a state sales tax rate reduction, from 5.125 to 5.0 percent. New Mexico’s sales tax is a hybrid tax, which the state calls a gross receipts tax, with an overly broad base that includes more business-to-business transactions than most states’ sales taxes. Combined with a modest improvement in unemployment insurance taxes relative to changes in other states, this rate cut propelled New Mexico five places on the Index, from 27th to 22nd overall."
    },
    {
      "id": 40, 
      "text": "In a tax package that may be just the beginning, Oklahoma trimmed its top marginal individual income tax rate from 5 to 4.75 percent, cut the corporate rate from 6 to 4 percent (tied for second lowest), and became the first state to make its full expensing policy permanent. Since Oklahoma already had full expensing, the latter policy does not impact the state’s score for now, but with federal bonus depreciation scheduled to phase down beginning in 2023, if other states do not make their own adjustments, their provisions will become less generous while Oklahoma’s pro-investment policies remain intact.   Oklahoma improved five places on the Index, from 28th to 23rd."
    },
    {
      "id": 45, 
      "text": "South Carolina income tax reforms—retroactive to the first of the year—reduced   the top rate from 7.0 to 6.5 percent while consolidating several brackets. The state has long had the highest top rate in the southeast, and while it maintains that distinction under this recent rate reduction, the gap between South Carolina and its neighbors has narrowed. The state improved two places on the Index, from 33rd to 31st, with further improvements anticipated in future years as the tax rate continues to phase down."
    },
    {
      "id": 53, 
      "text": "Washington experienced the worst slide in Index ranking this year, falling 13 places from 15th to 28th, primarily due to giving up its status as a state without an income tax. The state adopted a capital gains income tax on high earners which contains a sizeable marriage penalty and is not adjusted for inflation. Washington, with its unenviably aggressive gross receipts tax and high-rate sales tax, has always been buoyed on the Index by forgoing an income tax. With the loss of this distinctive, the state plummeted in our rankings."
    }
  ]

  