[
  {
    "id": 12,
    "text": "Florida’s corporate income tax declined from 5.5 to 4.4458 percent in September 2019, effective for tax years 2019-2021. This temporary reduction is the result of revenue triggers adopted in 2018, and enhanced revenue from corporate base broadening—the result of the federal Tax Cuts and Jobs Act (TCJA)—quickly met the 7 percent excess collections threshold required for a rate reduction. The lower rate does not change Florida’s already enviable rank of 4th overall but does improve the state’s corporate tax component rank from 9th to 6th."
  },
  {
    "id": 18,
    "text": "The only state to make midyear rate adjustments, Indiana made another scheduled adjustment to its corporate income tax rate on July 1, 2020, the Index’s snapshot date, bringing the rate from 5.5 to 5.25 percent. The rate reduction—two more are scheduled, ultimately bringing the rate to 4.9 percent in 2022—was enough to improve Indiana’s rank from 10th to 9th overall."
  },
  {
    "id": 19,
    "text": "On the corporate tax front, Iowa policymakers decoupled from IRC § 163(j), the net interest limitation, and fully decoupled from the Global Intangible Low-Taxed Income (GILTI) provision, which, when incorporated into state tax codes, leads to state taxation of international income. These changes improved Iowa’s corporate component rank by two places. The state also, as part of the ongoing implementation of a larger tax reform package, increased the Section 179 expensing allowance from $100,000 to $1 million, matching the federal level, leading to a two-place improvement on the individual component rank as well. These reforms, taken together, drove Iowa’s improvement from 45th to 40th on the Index overall. "
  },
  {
    "id": 20,
    "text": "Although Kansas has largely resisted tax conformity changes that would forgo any of the additional revenue associated with TCJA base broadening, the state’s existing tax conformity laws led to the temporary adoption of the five-year net operating loss carryback provisions afforded by the Coronavirus Aid, Relief and Economic Security (CARES) Act, dramatically—if temporarily—improving the state’s otherwise stingy treatment of business losses. With this change, the state’s corporate component rank rose from 35th to 31st, though the state’s overall rank remains unchanged at 35th."
  },
  {
    "id": 29,
    "text": "In 2018, Missouri adopted individual and corporate income tax reforms, set to phase in over time. Last year saw a significant reduction in the top rate of the individual income tax, from 5.9 to 5.4 percent, with smaller triggered reductions scheduled for future years until the rate declines to 5.1 percent. No additional rate cut has been triggered thus far. The corporate income tax reform package did, however, go into effect in 2020. The state no longer gives companies the option of choosing the apportionment formula most favorable to them, but this consolidation into a single apportionment formula paid down a significant corporate income tax rate reduction, from 6.25 to 4 percent, improving the state’s rank on the corporate tax component from 5th to 3rd and allowing the state to improve from 15th to 12th on the Index overall."
  },
  {
    "id": 34,
    "text": "Two years ago, New Jersey lawmakers adopted a temporary corporate surtax, imposing an additional 2.5 percent atop the existing corporate income tax rate for companies with income of $1 million or more, applicable for tax years 2018 and 2019, before dropping to 1.5 percent for 2020 and 2021. This year’s partial rollback of the surtax, yielding a top rate of 10.5 percent (down from 11.5 percent), improved New Jersey one place on the corporate tax component, from 49th to 48th. The state remains 50th on the Index overall."
  },
  {
    "id": 41,
    "text": "In May 2019, the Oregon legislature adopted a modified gross receipts tax, imposed at $250 plus a rate of 0.57 percent on Oregon gross receipts above $1 million. Taxpayers are permitted to subtract 35 percent of the greater of compensation or the cost of goods sold, putting it somewhere between Ohio’s commercial activity tax and Texas’ franchise (“margin”) tax.  For comparison, Ohio’s tax is imposed at a rate of 0.26 percent and the higher of Texas’s two rates on its narrower-based tax is 0.75 percent. Oregon, which straddles the difference between the two rates, is now one of only two states, with Delaware, to impose both a corporate income tax and a gross receipts tax. The new tax dropped the state 16 places on the corporate tax component, from 33rd to 49th, while the state’s overall rank slipped from 8th to 15th."
  }
]